<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class DesignationSeeder extends Seeder
{
    public function run(): void
    {
        $designations = [
            ['grade' => '১', 'name' => 'সিনিয়র সচিব', 'class' => 'প্রথম শ্রেণি'],
            ['grade' => '১', 'name' => 'সচিব', 'class' => 'প্রথম শ্রেণি'],
            ['grade' => '১', 'name' => 'সদস্য', 'class' => 'প্রথম শ্রেণি'],
            ['grade' => '২', 'name' => 'অতিরিক্ত সচিব', 'class' => 'প্রথম শ্রেণি'],
            ['grade' => '২', 'name' => 'প্রধান', 'class' => 'প্রথম শ্রেণি'],
            ['grade' => '৩', 'name' => 'যুগ্মসচিব', 'class' => 'প্রথম শ্রেণি'],
            ['grade' => '৩', 'name' => 'যুগ্মপ্রধান', 'class' => 'প্রথম শ্রেণি'],
            ['grade' => '৪', 'name' => 'সিনিয়র সিস্টেম এনালিস্ট', 'class' => 'প্রথম শ্রেণি'],
            ['grade' => '৫', 'name' => 'উপসচিব', 'class' => 'প্রথম শ্রেণি'],
            ['grade' => '৫', 'name' => 'উপপ্রধান', 'class' => 'প্রথম শ্রেণি'],
            ['grade' => '৫', 'name' => 'পরিচালক', 'class' => 'প্রথম শ্রেণি']
            ['grade' => '৫', 'name' => 'সিনিয়র প্রোগ্রামার', 'class' => 'প্রথম শ্রেণি'],
            ['grade' => '৬', 'name' => 'সিনিয়র সহকারী সচিব', 'class' => 'প্রথম শ্রেণি'],
            ['grade' => '৬', 'name' => 'সিনিয়র সহকারী প্রধান', 'class' => 'প্রথম শ্রেণি'],
            ['grade' => '৬', 'name' => 'মেইনটেন্যান্স ইঞ্জিনিয়ার', 'class' => 'প্রথম শ্রেণি'],
            ['grade' => '৬', 'name' => 'প্রোগ্রামার', 'class' => 'প্রথম শ্রেণি'],
            ['grade' => '৬', 'name' => 'সহকারী পরিচালক', 'class' => 'প্রথম শ্রেণি'],
            ['grade' => '৬', 'name' => 'জনসংযোগ কর্মকর্তা', 'class' => 'প্রথম শ্রেণি'],
            ['grade' => '৬', 'name' => 'সিনিয়র গবেষনা কর্মকর্তা', 'class' => 'প্রথম শ্রেণি'],
            ['grade' => '৯', 'name' => 'সহকারী সচিব', 'class' => 'প্রথম শ্রেণি'],
            ['grade' => '৯', 'name' => 'সহকারী প্রধান', 'class' => 'প্রথম শ্রেণি'],
            ['grade' => '৯', 'name' => 'সহকারী প্রোগ্রামার', 'class' => 'প্রথম শ্রেণি'],
            ['grade' => '৯', 'name' => 'সহকারী মেইনটেন্যান্স ইঞ্জিনিয়ার', 'class' => 'প্রথম শ্রেণি'],
            ['grade' =>'৯', 'name' => 'আইন কর্মকর্তা', 'class' => 'প্রথম শ্রেণি'],
            ['grade' =>'৯', 'name' => 'গবেষনা কর্মকর্তা', 'class' => 'প্রথম শ্রেণি'],
            ['grade' =>'৯', 'name' => 'বাজেট অফিসার', 'class' => 'প্রথম শ্রেণি'],
            ['grade' =>'৯', 'name' => 'লাইব্রেরী অফিসার', 'class' => 'প্রথম শ্রেণি'],
            ['grade' =>'৯', 'name' => 'ডকুমেন্টেশন অফিসার', 'class' => 'প্রথম শ্রেণি'],
            ['grade' =>'৯', 'name' => 'হিসাবরক্ষণ কর্মকর্তা', 'class' => 'প্রথম শ্রেণি'],
            ['grade' => '১০', 'name' => 'প্রশাসনিক কর্মকর্তা', 'class' => 'দ্বিতীয় শ্রেণি'],
            ['grade' => '১০', 'name' => 'ব্যক্তিগত কর্মকর্তা', 'class' => 'দ্বিতীয় শ্রেণি'],
            ['grade' => '১০', 'name' => 'লাইব্রেরীয়ান', 'class' => 'দ্বিতীয় শ্রেণি'],
            ['grade' => '১০', 'name' => 'গবেষনা অনুসন্ধানী', 'class' => 'দ্বিতীয় শ্রেণি'],
            ['grade' => '১০', 'name' => 'সহকারী হিসাবরক্ষণ কর্মকর্তা', 'class' => 'দ্বিতীয় শ্রেণি'],
            ['grade' => '১১', 'name' => 'হিসাবরক্ষক', 'class' => 'তৃতীয় শ্রেণি'],
            ['grade' => '১১', 'name' => 'ট্রেজারার', 'class' => 'তৃতীয় শ্রেণি'],
            ['grade' => '১৩', 'name' => 'কম্পিউটার অপারেটর', 'class' => 'তৃতীয় শ্রেণি'],
            ['grade' => '১৩', 'name' => 'ড্রাফট্সম্যান', 'class' => 'তৃতীয় শ্রেণি'],
            ['grade' => '১৩', 'name' => 'সাঁটমুদ্রাক্ষরিক কাম কম্পিউটার অপারেটর', 'class' => 'তৃতীয় শ্রেণি'],
            ['grade' => '১৬', 'name' => 'ট্রেসার', 'class' => 'তৃতীয় শ্রেণি'],
            ['grade' => '১৬', 'name' => 'টেলিফোন অপারেটর', 'class' => 'তৃতীয় শ্রেণি'],
            ['grade' => '১৬', 'name' => 'প্রুপ রিডার', 'class' => 'তৃতীয় শ্রেণি'],
            ['grade' => '১৬', 'name' => 'ফটোকপি অপারেটর', 'class' => 'তৃতীয় শ্রেণি'],
            ['grade' => '১৬', 'name' => 'ক্যাশ সরকার', 'class' => 'তৃতীয় শ্রেণি'],
            ['grade' => '১৮', 'name' => 'দপ্তরী', 'class' => 'চতুর্থ শ্রেণি']
            ['grade' => '১৯', 'name' => 'সর্টার', 'class' => 'চতুর্থ শ্রেণি'],
            ['grade' => '২০', 'name' => 'বুক এটেনডেন্ট', 'class' => 'চতুর্থ শ্রেণি'],
            ['grade' => '২০', 'name' => 'অফিস সহায়ক', 'class' => 'চতুর্থ শ্রেণি']
        ];


        DB::table('designations')->insert($designations);
    }
}
